

def gh_value(data):
    '''金山充值url路径参数'''
    '''
        参数 item=jx3 way=kcard 剑网3 item=jx2 way=kcard 剑网2 item=jx2wz way=kcard 剑网2外传 item=jxsj2 way=kcard 剑侠世界 
        item=jx way=kcard 剑网1 item=cs way=kcard 反恐行动 item=fs way=kcard 封神榜 item=cq way=kcard 春秋Q传
    '''
    # data = request.form.get('game_id')
    value_dict = {
        '0': 'jx3', # 剑网3
        '1': 'jx2', # 剑网2
        '2': 'jx2wz', # 剑网2外传
        '3': 'jxsj2', # 剑侠世界
        '4': 'jx', # 剑网1
        '5': 'cs', # 反恐行动
        '6': 'fs', # 封神榜 元宝区
        '7': 'fsib', # 封神榜 元宝区
        '8': 'cq', # 春秋Q传
    }
    return value_dict[data]


# def account_number(data):
def account_number():
    '''用户账号'''
    # number = 'a19438z@163.com' # 搜狐
    # number = 'a19438z' # 刀剑
    # number = '18021701751' # 巨人
    number = '18021701751' # 完美
    return number


def card_number():
    '''卡号'''
    # card = '1702012012988' # 金山
    # card = '84498942499007750766' # 搜狐
    # card = '0100101328280305' # 巨人
    card = '9054334471' # 完美
    return card


def card_password():
    '''密码'''
    # password = 'AJ4WBAQGW' # 金山
    # password = '804780667557' # 搜狐
    # password = '37457595' # 巨人
    password = '337892342204732' # 完美
    return password


def choice_sever(data):
    # 剑网3
    '''01 = 电信一区(点月卡) 05 = 电信五区(点卡) 08 = 电信八区(点卡) 21 = 双线一区(点卡) 22 = 双线二区(点月卡) 24 = 双线四区(点卡)'''
    choice_dict = {
        '电信一区(点月卡)': '//li[@id="pay_gateway_z01"]',
        '电信五区(点卡)': '//li[@id="pay_gateway_z05"]',
        '电信八区(点卡)': '//li[@id="pay_gateway_z08"]',
        '双线一区(点卡)': '//li[@id="pay_gateway_z21"]',
        '双线二区(点月卡)': '//li[@id="pay_gateway_z22"]',
        '双线四区(点卡)':  '//li[@id="pay_gateway_z24"]',
    }
    return choice_dict[data]


def choice_moneyclassfiy(data):
    # 剑网3
    '''_6 通宝,_1月卡,_2点卡'''
    choice_dict = {
        '通宝': '//div[@id="pay_recharge_type_6"]',
        '月卡': '//div[@id="pay_recharge_type_1"]',
        '点卡': '//div[@id="pay_recharge_type_2"]',
    }
    return choice_dict[data]


def choice_sever_jw2(data):
    # 剑网2
    '''收费区, 免费区, 新传区'''
    choice_dict = {
        '收费区': '//div[@id="undefined_jx2"]',
        '免费区': '//div[@id="undefined_jx2ib"]',
        '新传区': '//div[@id="undefined_jx2xz"]',
    }
    return choice_dict[data]


def choice_moneyclassfiy_jw2(data):
    # 剑网2
    '''包周/包月, 记点, 大银票'''
    choice_dict = {
        '包周/包月': '//div[@id="pay_recharge_type_1"]',
        '记点': '//div[@id="pay_recharge_type_2"]',
        '大银票': '//div[@id="pay_recharge_type_3"]',
    }
    return choice_dict[data]


def choice_sever_jxsj(data):
    # 剑侠世界
    '''剑世区（原电信区，网通区）, 绿色区'''
    choice_dict = {
        '剑世区': '//li[@id="pay_gateway_z01"]',
        '绿色区': '//li[@id="pay_gateway_jslv01"]',
    }
    return choice_dict[data]


def choice_sever_jx(data):
    # 剑网1
    '''收费区, 免费区, 经典区, 2010区'''
    choice_dict = {
        '收费区': '//div[@id="undefined_jx"]',
        '免费区': '//div[@id="undefined_jxib"]',
        '经典区': '//div[@id="undefined_jxcl"]',
        '2010区': '//div[@id="undefined_njxib"]',
    }
    return choice_dict[data]


def choice_money_jx(data):
    # 剑网1
    '''包时, 记点, 金币'''
    choice_dict = {
        '包时': '//div[@id="pay_recharge_type_1"]',
        '记点': '//div[@id="pay_recharge_type_2"]',
        '金币': '//div[@id="pay_recharge_type_5"]',
    }
    return choice_dict[data]


def choice_sever_cs(data):
    # 反恐行动
    '''联通区, 电信区'''
    choice_dict = {
        '联通区': 'pay_gateway_z01',
        '电信区': 'pay_gateway_z02',
    }
    return choice_dict[data]


def choice_sever_cqqz(data):
    # 春秋q传
    '''1-10区电信/全部网通, 12-45区电信'''
    choice_dict = {
        '1-10区电信/全部网通': 'pay_gateway_1',
        '12-45区电信': 'pay_gateway_23',
    }
    return choice_dict[data]


def choice_sever_SOHU(data):
    # 搜狐服务器选择
    '''3,15,16,20,24 为单选, 31,55,42为多选'''
    choice_dict = {
        '3': '//a[text()="新天龙八部"]',
        '15': '//a[text()="九鼎传说"]',
        '16': '//a[text()="新水浒Ｑ传"]',
        '20': '//a[text()="鹿鼎记"]',
        '24': '//a[text()="桃园2.0"]',
        '31': '//a[text()="幻想神域"]',
        '55': '//a[text()="海战世界"]',
        '42': '//a[text()="星际战甲"]',
    }
    return choice_dict[data]


def neteasy_email_password(data):
    # 网易登陆账号与密码
    choice_dict = {
        '账号': '13810641944@163.com',
        '密码': 'liqingyu1017'
    }
    return choice_dict[data]


def will_topup_number(data):
    # 网易需充值的账号
    choice_dict = {
        '账号': 'nap2017@yeah.net',
        '手机号': '15965621912'
    }
    return choice_dict[data]


def perfect_login(data):
    '''完美世界点券登陆需要参数'''
    choice_dict = {
        '账号': '18021701751',
        '密码': '888888aaA'
    }
    return choice_dict[data]


def perfect_number(data):
    # 完美世界充值账号参数
    choice_dict = {
        '账号': '18021701751'
    }
    return choice_dict[data]


def perfect_topup(data):
    # 完美世界充值卡密参数
    choice_dict = {
        '卡号': '9054334471',
        '卡密': '337892342204732'
    }
    return choice_dict[data]


def choice_game_wm(data):
    '''完美(滑块验证版)选择游戏'''
    # 笑傲江湖 , 诛仙3, 完美世界国际版, 神魔大陆, 武林外传, 赤壁, 完美世界经典版, 神鬼传奇, 梦幻诛仙, 热舞派对, 神雕侠侣, 口袋西游, 神雕侠侣怀旧
    choice_dict = {
        '诛仙3': 'https://pay.wanmei.com/new/newpay.do?op=prepay&gametype=4', # '0':
        '笑傲江湖': 'https://pay.wanmei.com/new/newpay.do?op=prepay&gametype=16', # '1':
        '完美世界国际版': 'https://pay.wanmei.com/new/newpay.do?op=prepay&gametype=3', # '2':
        '神魔大陆': 'https://pay.wanmei.com/new/newpay.do?op=prepay&gametype=12', # '3':
        '武林外传': 'https://pay.wanmei.com/new/newpay.do?op=prepay&gametype=2', # '4':
        '赤壁': 'https://pay.wanmei.com/new/newpay.do?op=prepay&gametype=5', # '5':
        '完美世界经典版': 'https://pay.wanmei.com/new/newpay.do?op=prepay&gametype=1', # '6':
        '神鬼传奇': 'https://pay.wanmei.com/new/newpay.do?op=prepay&gametype=11', # '7':
        '梦幻诛仙': 'https://pay.wanmei.com/new/newpay.do?op=prepay&gametype=8', # '8':
        '热舞派对': 'https://pay.wanmei.com/new/newpay.do?op=prepay&gametype=6', # '9':
        '神雕侠侣': 'https://pay.wanmei.com/new/newpay.do?op=prepay&gametype=19', # '10':
        '口袋西游': 'https://pay.wanmei.com/new/newpay.do?op=prepay&gametype=7', # '11':
        '神雕侠侣怀旧': 'https://pay.wanmei.com/new/newpay.do?op=prepay&gametype=54' # '12':
    }
    return choice_dict[data]


def choice_wm_district(district):
    '''完美选择服'''
    choice_district = {
        # 诛仙3
        '变天战区': '//li[text()="变天战区"]', '幽天战区': '//li[text()="幽天战区"]', '先遣体验服': '//li[text()="先遣体验服"]',
        '昊天战区': '//li[text()="昊天战区"]', '朱天战区': '//li[text()="朱天战区"]', '炎天战区': '//li[text()="炎天战区"]',
        '玄天战区': '//li[text()="玄天战区"]', '苍天战区': '//li[text()="苍天战区"]', '钧天战区': '//li[text()="钧天战区"]',
        '阳天战区': '//li[text()="阳天战区"]',
        # 笑傲江湖
        '一统江湖': '//li[text()="一统江湖"]', '号令天下': '//li[text()="号令天下"]', '名扬四海': '//li[text()="名扬四海"]',
        '抢先测试': '//li[text()="抢先测试"]', '武林至尊': '//li[text()="武林至尊"]', '经典服专区': '//li[text()="经典服专区"]',
        '英姿卓越': '//li[text()="英姿卓越"]', '谁与争锋': '//li[text()="谁与争锋"]',
        # 完美世界国际版
        '涅槃双线': '//li[text()="涅槃双线"]', '至尊双线': '//li[text()="至尊双线"]',
        # 神魔大陆2
        '传承区': '//li[text()="传承区"]', '神启区': '//li[text()="神启区"]', # '体验区': '//li[text()="体验区"]',
        '秩序区': '//li[text()="秩序区"]', '经典区': '//li[text()="经典区"]', '经典服': '//li[text()="经典服"]',
        '荣耀区': '//li[text()="荣耀区"]', '远航区': '//li[text()="远航区"]',
        # 武林外传
        '双线专区': '//li[text()="双线专区"]', '经典专区': '//li[text()="经典专区"]', # '先遣体验服': '//li[text()="先遣体验服"]',
        # 赤壁
        '双线三区': '//li[text()="双线三区"]', '双线二区': '//li[text()="双线二区"]', '双线一区': '//li[text()="双线一区"]',
        '双线五区': '//li[text()="双线五区"]', '双线六区': '//li[text()="双线六区"]', '双线四区': '//li[text()="双线四区"]',
        '电信一区': '//li[text()="电信一区"]',
        # 完美世界经典版
        '完美世界': '//li[text()="完美世界"]', '完美世界经典服': '//li[text()="完美世界经典服"]',
        # 神鬼传奇
        '体验区': '//li[text()="体验区"]', '双线区': '//li[text()="双线区"]',
        # 梦幻诛仙2
        '双线互通': '//li[text()="双线互通"]', # '双线一区': '//li[text()="双线一区"]',
        # 热舞派对
        '网通一区': '//li[text()="网通一区"]', # '电信一区': '//li[text()="电信一区"]', '双线一区': '//li[text()="双线一区"]',
        # 射雕侠侣
        '嘉兴城': '//li[text()="嘉兴城"]', '襄阳城': '//li[text()="襄阳城"]',
        # 口袋西游
        # '双线区': '//li[text()="双线区"]',
        # 神雕侠侣怀旧版
        '怀旧区': '//li[text()="怀旧区"]',
    }
    return choice_district[district]


def choice_wm_server(server):
    '''完美选择服'''
    choice_district = {
        # 诛仙3
        '先知': '//a[@data="888"]', '剑尊鸿威': '//a[@data="822"]', '星耀至尊': '//a[@data="800"]', '横刀百战': '//a[@data="581"]',
        '雷霆王者': '//a[@data="506"]', '鸿蒙争霸': '//a[@data="877"]', '一剑诛仙': '//a[@data="990"]', '情系十年': '//a[@data="2049"]',
        '晓梦飞花': '//a[@data="2051"]', '霜影逐龙': '//a[@data="2062"]', '风花雪月': '//a[@data="2053"]', '龙战八荒': '//a[@data="2067"]',
        '创世绮梦': '//a[@data="517"]', '碧瑶': '//a[@data="821"]', '豪杰永生': '//a[@data="995"]', '雪琪(网通)': '//a[@data="2079"]',
        '龙腾碧霄': '//a[@data="519"]', '九天浮影': '//a[@data="982"]', '万里河山': '//a[@data="968"]', '乾坤两仪': '//a[@data="996"]',
        '决战天下': '//a[@data="947"]', '星梦奇缘': '//a[@data="2008"]', '烽火流年': '//a[@data="804"]', '碧瑶(电信)': '//a[@data="838"]',
        '金龙之魂': '//a[@data="556"]', '雪琪': '//a[@data="847"]', '风驰碧海': '//a[@data="541"]', '魔龙恒星': '//a[@data="513"]',
        '决胜云天': '//a[@data="595"]', '独霸天关': '//a[@data="554"]', '龙吟江南': '//a[@data="927"]', '幻月御风': '//a[@data="502"]',
        '承天竹影': '//a[@data="505"]', '紫电荣光': '//a[@data="527"]', '问鼎六道': '//a[@data="550"]', '霜雪玉龙': '//a[@data="507"]',
        '冷月笙花': '//a[@data="523"]', '幻心千劫': '//a[@data="531"]', '诀世天昭': '//a[@data="2060"]', '诀算风云': '//a[@data="2076"]',
        '鹊驾星桥': '//a[@data="2084"]', '一战惊天': '//a[@data="585"]', '千灯昭愿': '//a[@data="2078"]', '妙舞云歌': '//a[@data="2081"]',
        '岚焰逐风': '//a[@data="2064"]', '惊刀断玉': '//a[@data="2065"]', '月明风清': '//a[@data="516"]', '灼灼桃花': '//a[@data="816"]',
        '雪墨云烟': '//a[@data="958"]',
        # 笑傲江湖 168
        '三花聚顶': '//a[@data="20486"]', '万岳朝宗': '//a[@data="20494"]', '十八铜人': '//a[@data="20629"]',
        '五罗轻烟': '//a[@data="20486"]', '冲灵剑法': '//a[@data="20494"]', '大海无量': '//a[@data="20629"]',
        '分筋错骨': '//a[@data="20486"]', '化功大法': '//a[@data="20494"]', '天罗地网': '//a[@data="20629"]',
        '双剑合璧': '//a[@data="20486"]', '化骨绵掌': '//a[@data="20494"]', '太祖长拳': '//a[@data="20629"]',
        '天山折梅': '//a[@data="20486"]', '漫天花雨': '//a[@data="20494"]', '寒冰真气': '//a[@data="20629"]',
        '左右互搏': '//a[@data="20486"]', '玄冥神掌': '//a[@data="20494"]', '小无相功': '//a[@data="20629"]',
        '袈裟伏魔': '//a[@data="20486"]', '神行百变': '//a[@data="20494"]', '快意恩仇': '//a[@data="20629"]',
        '袖里乾坤': '//a[@data="20486"]', '黄沙万里': '//a[@data="20494"]', '纯阳无极': '//a[@data="20629"]',
        '飘雪穿云': '//a[@data="20486"]', '侠骨柔情': '//a[@data="20494"]', '回风落雁': '//a[@data="20629"]',
        '亢龙有悔': '//a[@data="20486"]', '寒冰神掌': '//a[@data="20494"]', '太极拳经': '//a[@data="20629"]',
        '太玄神功': '//a[@data="20486"]', '火焰刀法': '//a[@data="20494"]', '真武七截': '//a[@data="20629"]',
        '排山倒海': '//a[@data="20486"]', '达摩剑法': '//a[@data="20494"]', '神照大法': '//a[@data="20629"]',
        '混元无极': '//a[@data="20486"]', '雷厉风行': '//a[@data="20494"]', '翻天神掌': '//a[@data="20629"]',
        '潜龙勿用': '//a[@data="20486"]', '龙象般若': '//a[@data="20494"]', '雨打飞花': '//a[@data="20629"]',
        '神龙摆尾': '//a[@data="20486"]', '体验专区': '//a[@data="20484"]', '龙行天下': '//a[@data="20629"]',
        '藏龙卧虎': '//a[@data="20486"]', '测试专区': '//a[@data="20611"]', '三生三世': '//a[@data="20629"]',
        '辟邪剑法': '//a[@data="20486"]', '六脉神剑': '//a[@data="20494"]', '华山论剑': '//a[@data="20629"]',
        '飞龙在天': '//a[@data="20486"]', '义薄云天': '//a[@data="20494"]', '君临天下': '//a[@data="20629"]',
        '龙争虎斗': '//a[@data="20486"]', '乾坤挪移': '//a[@data="20494"]', '唯我独尊': '//a[@data="20629"]',
        '龙战于野': '//a[@data="20486"]', '凌波微步': '//a[@data="20494"]', '天下第一': '//a[@data="20629"]',
        '龙跃于渊': '//a[@data="20486"]', '北冥神功': '//a[@data="20494"]', '威震八方': '//a[@data="20629"]',
        '一笑倾城': '//a[@data="20486"]', '只手遮天': '//a[@data="20494"]', '月光宝盒': '//a[@data="20629"]',
        '东方不败': '//a[@data="20486"]', '风卷残云': '//a[@data="20494"]', '横扫千军': '//a[@data="20629"]',
        '乱世英雄': '//a[@data="20486"]', '风起云涌': '//a[@data="20494"]', '浪荡乾坤': '//a[@data="20629"]',
        '傲睨天下': '//a[@data="20486"]', '黯然销魂': '//a[@data="20494"]', '海誓山盟': '//a[@data="20629"]',
        '凤凰涅槃': '//a[@data="20486"]', '一战成名': '//a[@data="20674"]', '潜龙腾渊': '//a[@data="20629"]',
        '剑荡八荒': '//a[@data="20486"]', '剑出东华': '//a[@data="20687"]', '烽烟四起': '//a[@data="20629"]',
        '峥嵘岁月': '//a[@data="20486"]', '宠你所爱': '//a[@data="20674"]', '独步天下': '//a[@data="20629"]',
        '征战八方': '//a[@data="20486"]', '拨云见日': '//a[@data="20684"]', '皇图霸业': '//a[@data="20629"]',
        '战无不胜': '//a[@data="20486"]', '桀骜不驯': '//a[@data="20681"]', '盖世无双': '//a[@data="20629"]',
        '猛龙过江': '//a[@data="20486"]', '牢不可破': '//a[@data="20688"]', '不动明王': '//a[@data="20629"]',
        '纵横沙场': '//a[@data="20486"]', '缘定三生': '//a[@data="20685"]', '人在江湖': '//a[@data="20629"]',
        '群雄争霸': '//a[@data="20486"]', '风云再起': '//a[@data="20674"]', '侠肝义胆': '//a[@data="20629"]',
        '群雄逐鹿': '//a[@data="20486"]', '八荒四海': '//a[@data="20653"]', '兵临城下': '//a[@data="20629"]',
        '醉酒当歌': '//a[@data="20486"]', '义气千秋': '//a[@data="20653"]', '剑胆琴心': '//a[@data="20629"]',
        '雄霸天下': '//a[@data="20486"]', '卓尔不凡': '//a[@data="20653"]', '千手如来': '//a[@data="20629"]',
        '韶华倾负': '//a[@data="20486"]', '壮志凌云': '//a[@data="20653"]', '弹指神通': '//a[@data="20629"]',
        '九阳神功': '//a[@data="20486"]', '帮派风云': '//a[@data="20653"]', '斗转星移': '//a[@data="20629"]',
        '九阴真经': '//a[@data="20486"]', '披荆斩棘': '//a[@data="20653"]', '气吞山河': '//a[@data="20629"]',
        '吸星大法': '//a[@data="20486"]', '掀雷决电': '//a[@data="20653"]', '洗髓易筋': '//a[@data="20629"]',
        '天外飞仙': '//a[@data="20486"]', '日出东方': '//a[@data="20653"]', '清心普善': '//a[@data="20629"]',
        '如来神掌': '//a[@data="20486"]', '月下良缘': '//a[@data="20653"]', '碧海潮生': '//a[@data="20629"]',
        '翻云覆雨': '//a[@data="20486"]', '独孤九剑': '//a[@data="20653"]', '紫霞神功': '//a[@data="20629"]',
        '万夫莫敌': '//a[@data="20486"]', '生死江湖': '//a[@data="20653"]', '落英神剑': '//a[@data="20629"]',
        '傲气冲天': '//a[@data="20486"]', '绝世高手': '//a[@data="20653"]', '举世无双': '//a[@data="20629"]',
        '剑气凌云': '//a[@data="20486"]', '花好月圆': '//a[@data="20653"]', '剑指天下': '//a[@data="20629"]',
        '千军万马': '//a[@data="20486"]', '鏖战江湖': '//a[@data="20653"]', '友情岁月': '//a[@data="20629"]',
        '天人合一': '//a[@data="20486"]', '长风破浪': '//a[@data="20653"]', '叱咤风云': '//a[@data="20629"]',
        '峨眉金顶': '//a[@data="20486"]', '问鼎江湖': '//a[@data="20653"]', '石破天惊': '//a[@data="20629"]',
        '所向披靡': '//a[@data="20486"]', '风华正茂': '//a[@data="20653"]', '纵横天下': '//a[@data="20629"]',
        '清音万年': '//a[@data="20486"]', '一代宗师': '//a[@data="20494"]', '翻江倒海': '//a[@data="20629"]',
        '王者归来': '//a[@data="20486"]', '傲视群雄': '//a[@data="20494"]', '英雄本色': '//a[@data="20629"]',
        '电光火石': '//a[@data="20486"]', '出神入化': '//a[@data="20494"]', '风云际会': '//a[@data="20629"]',
        '胜者为王': '//a[@data="20486"]', '泰山北斗': '//a[@data="20494"]', '风驰电掣': '//a[@data="20629"]',
        '返璞归真': '//a[@data="20486"]', '神功盖世': '//a[@data="20494"]', '鱼跃冲顶': '//a[@data="20629"]',
        '霸者无双': '//a[@data="20486"]',

        # 完美世界国际版
        '云海': '//a[@data="106"]', '圣凌': '//a[@data="101"]', '圣炎': '//a[@data="154"]',
        '天穹': '//a[@data="6"]', '寻天': '//a[@data="148"]', '御龙': '//a[@data="89"]',
        '朔光': '//a[@data="136"]', '神威': '//a[@data="168"]', '踏剑': '//a[@data="93"]',
        '齐天': '//a[@data="174"]', '仙月': '//a[@data="120"]', '仙童': '//a[@data="131"]',
        '撼天': '//a[@data="134"]', '狩猎': '//a[@data="26"]', '风月': '//a[@data="13"]',
        # 神魔大陆2
        '凯旋之门': '//a[@data="1907"]', '光辉神殿': '//a[@data="1907"]', '巨树之灵': '//a[@data="1905"]', '杀戮深渊': '//a[@data="1907"]', '玫瑰花园': '//a[@data="1905"]', '雷霆圣域': '//a[@data="1995"]',
        '抉择之殇': '//a[@data="1907"]', '冠军荣耀': '//a[@data="1995"]', '巨龙之脊': '//a[@data="1995"]', '比尔血盟': '//a[@data="1905"]', '生命之井': '//a[@data="1905"]', '静谧花园': '//a[@data="1995"]',
        '无冬之城': '//a[@data="1907"]', '冰火之心': '//a[@data="1940"]', '希望之光': '//a[@data="1905"]', '氏族荣耀': '//a[@data="1995"]', '碎砂营地': '//a[@data="1907"]', '预言之战': '//a[@data="1907"]',
        '极夜之地': '//a[@data="1907"]', '冰风战场': '//a[@data="1905"]', '幻月之瞳': '//a[@data="1907"]', '永恒信念': '//a[@data="1905"]', '神怒雪峰': '//a[@data="1907"]', '风雪之灵': '//a[@data="1995"]',
        '永昼之台': '//a[@data="1907"]', '决战星河': '//a[@data="1907"]', '幽暗之始': '//a[@data="1907"]', '永歌草原': '//a[@data="1905"]', '群屿之角': '//a[@data="1905"]', '骨矛营地': '//a[@data="1995"]',
        '混乱之源': '//a[@data="1940"]', '凛冬之战': '//a[@data="1907"]', '幽暗森林': '//a[@data="1905"]', '泰坦之王': '//a[@data="1995"]', '自由曙光': '//a[@data="1907"]', '魔法荒原': '//a[@data="1995"]',
        '体验服': '//a[@data="1949"]', '创世神殿': '//a[@data="1995"]', '微风山谷': '//a[@data="1995"]', '浪漫旋律': '//a[@data="1995"]', '自由绽放': '//a[@data="1907"]', '黄金罗盘': '//a[@data="1995"]',
        '毁灭之刃': '//a[@data="1928"]', '勇者同盟': '//a[@data="1907"]', '怒焰神殿': '//a[@data="1995"]', '浴血战歌': '//a[@data="1905"]', '苍穹霸主': '//a[@data="1907"]', '黄金罗盘': '//a[@data="1995"]',
        '神之意志': '//a[@data="1984"]', '勇者觉醒': '//a[@data="1907"]', '慕雪山脉': '//a[@data="1907"]', '淘金平原': '//a[@data="1907"]', '英灵峡谷': '//a[@data="1907"]', '黎明港湾': '//a[@data="1995"]',
        '神之领域': '//a[@data="1984"]', '北极山脉': '//a[@data="1907"]', '战神之魂': '//a[@data="1905"]', '深渊之战': '//a[@data="1907"]', '英雄传说': '//a[@data="1995"]', '黑汐森林': '//a[@data="1907"]',
        '诸神之战': '//a[@data="1940"]', '反攻号角': '//a[@data="1995"]', '战锤山谷': '//a[@data="1907"]', '深渊暗影': '//a[@data="1995"]', '英雄广场': '//a[@data="1995"]', '自由港': '//a[@data="1923"]',
        '黎明之城': '//a[@data="1922"]', '史诗之路': '//a[@data="1995"]', '拓荒之地': '//a[@data="1907"]', '深渊领域': '//a[@data="1905"]', '荆棘营地': '//a[@data="1905"]', '众神之威': '//a[@data="1940"]',
        '无风剑冢': '//a[@data="1984"]', '命运之台': '//a[@data="1907"]', '无尽海域': '//a[@data="1905"]', '灰雾荒原': '//a[@data="1907"]', '荣耀之都': '//a[@data="1995"]', '元素之巅': '//a[@data="1940"]',
        '晨曦之地': '//a[@data="1984"]', '回音沙漠': '//a[@data="1905"]', '旭日城堡': '//a[@data="1995"]', '灵魂之井': '//a[@data="1905"]', '荣耀之陵': '//a[@data="1905"]', '冰火荣耀': '//a[@data="1940"]',
        '曙光之地': '//a[@data="1984"]', '圆目之峰': '//a[@data="1905"]', '星罗群岛': '//a[@data="1907"]', '灵魂圣地': '//a[@data="1907"]', '落日之山': '//a[@data="1905"]', '地狱战歌': '//a[@data="1940"]',
        '湛蓝之月': '//a[@data="1984"]', '圣光之源': '//a[@data="1907"]', '星轮古树': '//a[@data="1905"]', '灾域虚空': '//a[@data="1907"]', '诸神梦境': '//a[@data="1905"]', '屠龙要塞': '//a[@data="1940"]',
        '秩序高地': '//a[@data="1984"]', '圣光殿堂': '//a[@data="1905"]', '星辰之歌': '//a[@data="1905"]', '炼狱火山': '//a[@data="1905"]', '辉煌遗迹': '//a[@data="1905"]', '暴风前夕': '//a[@data="1940"]',
        '苍蓝冰原': '//a[@data="1984"]', '圣火燃情': '//a[@data="1995"]', '晨曦圣歌': '//a[@data="1905"]', '烈焰之石': '//a[@data="1995"]', '迎风回廊': '//a[@data="1905"]', '永夜繁星': '//a[@data="1940"]',
        '荣耀殿堂': '//a[@data="1984"]', '夜语河谷': '//a[@data="1905"]', '暖冬高原': '//a[@data="1905"]', '狂暴之心': '//a[@data="1995"]', '远古沙漠': '//a[@data="1907"]', '纪元之门': '//a[@data="1940"]',
        '雄风营地': '//a[@data="1984"]', '天使之歌': '//a[@data="1907"]', '暮光之城': '//a[@data="1905"]', '狂热丛林': '//a[@data="1905"]', '远古遗迹': '//a[@data="1907"]', '荣耀之刃': '//a[@data="1940"]',
        '万王之陵': '//a[@data="1905"]', '天空之城': '//a[@data="1905"]', '暮色战歌': '//a[@data="1907"]', '狩魔大厅': '//a[@data="1905"]', '迷失灯塔': '//a[@data="1905"]', '诸神意志': '//a[@data="1940"]',
        '众神宝藏': '//a[@data="1905"]', '女神之手': '//a[@data="1905"]', '暴风军团': '//a[@data="1905"]', '狮心联盟': '//a[@data="1907"]', '遗忘之城': '//a[@data="1905"]', '北海冰原': '//a[@data="1995"]',
        '使徒圣殿': '//a[@data="1907"]', '女神之泪': '//a[@data="1995"]', '暴风禁地': '//a[@data="1905"]', '狼烟四起': '//a[@data="1995"]', '锡月林地': '//a[@data="1995"]', '希望之海': '//a[@data="1995"]',
        '元素战争': '//a[@data="1995"]', '寒冰深渊': '//a[@data="1995"]', '暴风龙穴': '//a[@data="1905"]', '王者之歌': '//a[@data="1940"]', '阳光海岸': '//a[@data="1905"]', '爱神之泉': '//a[@data="1995"]',
        '光辉岁月': '//a[@data="1905"]', '巅峰之战': '//a[@data="1995"]', '曙光之影': '//a[@data="1995"]', '玫瑰之约': '//a[@data="1907"]', '雷霆之怒': '//a[@data="1995"]', '龙之群屿': '//a[@data="1995"]',
        '龙魂觉醒': '//a[@data="1995"]',
        # 武林外传
        '体验电信': '//a[@data="645"]', '体验网通': '//a[@data="646"]', '乾坤变': '//a[@data="626"]',
        '十年之约': '//a[@data="155"]', '妙策丹书': '//a[@data="632"]', '气壮山河': '//a[@data="630"]',
        '烽火春雷': '//a[@data="660"]', '独步天下': '//a[@data="642"]', '画龙点睛': '//a[@data="651"]',
        '白展堂': '//a[@data="750"]', '金戈铁马': '//a[@data="655"]', '青梅时雨': '//a[@data="638"]',
        '云飞扬': '//a[@data="71"]', '修罗怒': '//a[@data="51"]', '凌龙谷': '//a[@data="58"]',
        '千叶林': '//a[@data="103"]', '天殇': '//a[@data="59"]', '将军令': '//a[@data="605"]',
        '江山梦': '//a[@data="701"]', '风云决': '//a[@data="63"]',
        # 赤壁
        '凤舞乱世': '//a[@data="1034"]', '霸王龙吟': '//a[@data="1018"]', '万里苍穹': '//a[@data="1048"]',
        '四海祥麟': '//a[@data="1078"]', '千里独行': '//a[@data="1054"]', '天下承平': '//a[@data="1019"]',
        '八方风雨': '//a[@data="1081"]', '烈火惊雷': '//a[@data="1084"]', '竞逐天下': '//a[@data="1056"]',
        '虎踞龙蟠': '//a[@data="1007"]',
        # 完美世界经典版
        '完美世界': '//a[@data="1"]', '完美世界经典服': '//a[@data="9999"]',
        # 神鬼传奇
        '火凤凰': '//a[@data="1862"]', '创世岛': '//a[@data="2190"]', '双龙舟': '//a[@data="2144"]',
        '启示录': '//a[@data="1842"]', '圣战城': '//a[@data="1893"]', '奥丁塔': '//a[@data="1841"]',
        '诸神殿': '//a[@data="2199"]', '轮回殿': '//a[@data="2167"]', '远古城': '//a[@data="1817"]',
        '闪电宫': '//a[@data="1859"]', '龙魂殿': '//a[@data="1807"]',
        # 梦幻诛仙2
        '一寸玄庭': '//a[@data="1512"]', '九天归墟': '//a[@data="1553"]', '九天明镜': '//a[@data="1516"]',
        '伊甸佳苑': '//a[@data="1535"]', '半壁悬星': '//a[@data="1145"]', '半步登仙': '//a[@data="1128"]',
        '大道无极': '//a[@data="1166"]', '扬名天下': '//a[@data="1522"]', '法天象地': '//a[@data="1370"]',
        '潜龙在渊': '//a[@data="1560"]', '烟霞流波': '//a[@data="1107"]', '琴韵余音': '//a[@data="1167"]',
        '神天幻世': '//a[@data="1381"]', '群雄逐鹿': '//a[@data="1507"]', '虚怀若谷': '//a[@data="1594"]',
        '道心不毁': '//a[@data="1131"]', '龙啸仙山': '//a[@data="1548"]', '体验服': '//a[@data="1502"]',
        # 热舞派对 ??? 1205???
        '【MAX专线】': '//a[@data="1205"]', '华东一区': '//a[@data="1200"]', '西部一区｜华东二区': '//a[@data="1205"]', '华北一｜东北一｜东北二｜华中二': '//a[@data="1205"]',
        # 射雕侠侣
        '风起云涌': '//a[@data="3332"]', '百战百胜': '//a[@data="2608"]',
        # 口袋西游
        '降魔': '//a[@data="1478"]',
        # 神雕侠侣怀旧版
        '华山论剑': '//a[@data="5402"]', '浴火涅槃': '//a[@data="5407"]',
    }
    return choice_district[server]
